// УВАГА! СТУДЕНТИ, ЯКІ НАВЧАЮТЬСЯ ЗА КВІГОЮ МЕНТОРКИ ВІКТОРІЇ, ІНФОРМАЦІЯ ДЛЯ ВАС! =)
// Вам потрібно виконати ці завдання тільки з використанням if-else. Завдання на switch та функції будуть трохи далі =)


// ЗАВДАННЯ:

// 1. Попросити користувача ввести послідовно два числа через prompt (дві операції).
// (Перетворення на Number зробити явним - це ще по одному кроку на кожне число)

// Якщо сумма цих двох чисел ділиться на 5 - вивести alert, що сума кратна 5
// Інакше - вивести, що сума не кратна 5
// (одна перевірка на if, і гілка else, якщо ні)

// const num1 = Number(prompt('Enter the first number:')),
//       num2 = Number(prompt('Enter the second number:')),
//       sum = num1 + num2;

// if (sum % 5 == 0) {
//     alert('The sum is a multiple of 5');
// } else {
//     alert('The sum is not a multiple of 5');
// }





// 2. Написати функцію, яка приймає сторону квадрата та повертає його площу

const a = Number(prompt('Enter length of the side of the square:'))
if (!isNaN(a)) {
    alert(`The area of the square equals ` + Math.pow(a, 2));
    // console.log(Math.pow(a, 2));
}




// 3. Написати функцію, яка виводить промптом "меню" у вигляді
//      "1 - Чай
//       2 - Кава
//      3 - Сік
//      4 - Вода"
// (перенос рядка у модалці можна зробити за допомогою "\n")
// і очікує від користувача цифру, що відповідає напою. При виборі чогось доступного - вивести алерт на кшталт
// "Ви обрали сік" або "Ви обрали воду" (залежно від того, що там користувач обрав). Якщо введено щось не те - вивести "Такого напою у нас нема"

// Задачу вирішити через оператор switch-case







// 4. Користувач вводить суму покупки.
// Обчислити та вивести остаточну суму покупки з урахуванням знижки.
// Знижка 3% надається, якщо сума покупки більша за 500 грн., а знижка 5% - якщо сума покупки більша за 800 грн. Використати тернарний оператор






// 5. Реалізувати функцію, яка приймає два числа і перевіряє, чи ділиться перше на друге націло (без залишку). Функція має повертати булеве значення: true, якщо ділиться без залишку, false - не ділиться без залишку.







// Задачка з * для допитливих: написати функцію, яка приймає три коефіцієнта в якості аргумента та знаходить корені квадратного рівняння
// (PS. Поки що ми повертати з функції одразу два значення не вмієм, тому хай функція їх просто виведе на консоль або алертом)
// (гугл - "формула дискримінанта квадратного рівняння")